# AWS Tooling
brew 'awscli'

# CLI Productivity Tools
brew 'autojump'
brew 'cowsay'
brew 'fzf'
brew 'gh'
brew 'graphviz'
brew 'htop'
brew 'jid'
brew 'jq'
brew 'mas'
brew 'plantuml'
brew 'powerline-go'
brew 'pstree'
brew 'pv'
brew 'reattach-to-user-namespace'
brew 'restic'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'youtube-dl'
brew 'zsh'

# Dev Tools
brew 'dos2unix'
brew 'git'
brew 'gnupg'
brew 'kubernetes-cli'
brew 'neovim'
brew 'vim'

# Admin Tools
brew 'gnu-sed'
brew 'telnet'
brew 'tree'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'wireshark'
brew 'xz'

# Programming Languages
brew 'asdf'

# Dev Libraries
brew 'libxml2'

##############
# macOS Apps #
##############

# Applications
cask '1password'
cask 'adobe-creative-cloud'
cask 'discord'
cask 'google-chrome'
cask 'firefox'
cask 'licecap'
cask 'signal'
cask 'scroll-reverser'

# Dev Tools
cask 'docker'
cask 'iterm2'
cask 'visual-studio-code'

# Productivity Tools
cask 'alfred'
cask 'notion'
cask 'postman'
cask 'spectacle'
cask 'tomighty'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'

##################
# Mac Store Apps #
##################
mas 'Amazon Prime Video', id: 545519333
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Pocket', id: 568494494
mas 'Slack', id: 803453959
mas 'Tweetbot 2 For Twitter', id: 557168941
mas 'Twitter', id: 409789998
mas 'WhatsApp Desktop', id: 1147396723
