# AWS Tooling
brew 'awscli'

# CLI Productivity Tools
brew 'autojump'
brew 'cowsay'
brew 'fzf'
brew 'graphviz'
brew 'htop'
brew 'hub'
brew 'jid'
brew 'jq'
brew 'mas'
brew 'plantuml'
brew 'powerline-go'
brew 'pstree'
brew 'pv'
brew 'reattach-to-user-namespace'
brew 'restic'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'youtube-dl'
brew 'zsh'

# Dev Tools
brew 'dos2unix'
brew 'git'
brew 'gnupg'
brew 'kubernetes-cli'
brew 'neovim'
brew 'vim'

# Admin Tools
brew 'gnu-sed'
brew 'telnet'
brew 'tree'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'wireshark'
brew 'xz'

# Programming Languages
brew 'asdf'

# Dev Libraries
brew 'libxml2'

##############
# macOS Apps #
##############
cask '1password'
